# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [7]:
df = [4, 8, 15, 16, 23, 42]

In [8]:
df1 = pd.Series(df)

In [9]:
df1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable and print it.

In [10]:
list_1 = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

In [11]:
list_2 = pd.Series(list_1)

In [12]:
list_2

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

In [17]:
data = [['Alice',25,'Female'], ['Bob',30,'Male'], ['Caire',27,'Female']]

In [22]:
dataframe1 = pd.DataFrame(data, columns=['Name','Age','Gender'])

In [23]:
dataframe1

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Caire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe is a structured table with rows and columns. It is 2-dimensional in nature. dataframes can have multiple series.
Series is a single list with index.
For eg. 
above given variable 'dataframe' is a dataframe whereas 'df1' is a series

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Some common functions that are used to manipulate data in a pandas dataframe are:

In [29]:
## example of a dataset
example = pd.read_csv('output.csv')

In [31]:
##head function
example.head()

,Feature1,Feature2,Feature3,Feature4,Feature5,Feature6,Feature7,Feature8,Feature9,Feature10,Feature11,Feature12,Feature13,Feature14,Feature15,Feature16,Feature17,Feature18,Feature19,Feature20
0,44.0,0.797417,-0.958091,NaN,NaN,158.0,1.490148,5.166124,2.277942,NaN,5,X,1,Category1,Option4,8.824345,11.711130,Yes,Low,NaN
1,47.0,0.026838,-0.244178,D,NaN,NaN,2.151535,0.450312,-3.395356,NaN,3,X,0,Category1,Option2,NaN,13.355832,Yes,Low,cat
2,64.0,0.199990,-1.014799,B,0.0,474.0,1.410613,6.786555,-3.070746,NaN,7,Z,0,Category1,Option2,NaN,13.449484,Yes,Medium,dog
3,67.0,0.474124,0.448040,B,NaN,166.0,0.635091,1.937158,-0.246269,6.004975,20,X,0,Category1,Option2,NaN,7.687652,Yes,Low,cat
4,NaN,0.598516,0.087839,NaN,0.0,NaN,0.392104,4.010937,3.215086,2.891199,3,Z,0,Category1,Option3,11.259371,6.807770,Yes,Low,cat

In [32]:
##tail function
example.tail()

,Feature1,Feature2,Feature3,Feature4,Feature5,Feature6,Feature7,Feature8,Feature9,Feature10,Feature11,Feature12,Feature13,Feature14,Feature15,Feature16,Feature17,Feature18,Feature19,Feature20
4995,NaN,0.819440,0.415931,C,0.0,NaN,1.765590,1.929735,-1.951884,NaN,1,Z,1,Category2,Option4,NaN,14.821501,No,Low,NaN
4996,NaN,0.032140,-1.445420,C,1.0,NaN,0.806246,8.765315,-1.866815,NaN,1,Y,0,Category3,Option4,6.368173,5.308922,Yes,Medium,NaN
4997,92.0,0.263300,0.986722,C,NaN,78.0,1.326853,4.489722,1.720671,6.877962,1,X,0,Category1,Option4,5.682022,9.508951,Yes,Medium,NaN
4998,91.0,0.640986,-1.199847,A,0.0,51.0,0.312256,2.773963,-3.320704,6.138322,2,X,0,Category1,Option3,4.574748,8.705127,No,Medium,some other
4999,NaN,0.901570,1.836382,NaN,0.0,NaN,2.087461,6.854886,-0.259228,6.068139,6,X,0,Category2,Option2,12.801075,14.686372,Yes,High,some other

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Panel and Dataframe are MUTABLE whereas Series is IMMUTABLE in nature

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
frame = {'Number': df1, 'Number2': list_2}

In [37]:
result = pd.DataFrame(frame)

In [38]:
result

   Number  Number2
0     4.0       10
1     8.0       20
2    15.0       30
3    16.0       40
4    23.0       50
5    42.0       60
6     NaN       70
7     NaN       80
8     NaN       90
9     NaN      100